package com.bw.utils;

import java.util.Random;

public class StringUtil {

	/**
	 * @Title: hasLength
	 * @Description: ÅĞ¶ÏÔ´×Ö·û´®ÊÇ·ñÓĞÖµ, ¿ÕÒıºÅ(¿Õ°××Ö·û´®)Ò²ËãÃ»Öµ
	 * @param src
	 * @return
	 * @return: boolean
	 */
	public static boolean hasLength(String src) {
		return src != null && src.length() > 0;
	}

	/**
	 * @Title: hasText
	 * @Description: ÅĞ¶ÏÔ´×Ö·û´®ÊÇ·ñÓĞÖµ, ¿ÕÒıºÅ(¿Õ°××Ö·û´®)ºÍ¿Õ¸ñÒ²ËãÃ»Öµ
	 * @param src
	 * @return
	 * @return: boolean
	 */
	public static boolean hasText(String src) {
		return src != null && src.trim().length() > 0;
	}

	/**
	 * @Title: randomChineseString
	 * @Description: Ëæ»ú·µ»ØÒ»¸öÖĞÎÄºº×Ö
	 * @return
	 * @return: String
	 */
	public static String randomChineseString() {
		String str = null;
		int highPos, lowPos;
		Random random = new Random();
		highPos = (176 + Math.abs(random.nextInt(40)));
		lowPos = (161 + Math.abs(random.nextInt(95)));
		byte[] byteArr = new byte[2];

		byteArr[0] = (new Integer(highPos)).byteValue();
		byteArr[1] = (new Integer(lowPos)).byteValue();

		try {
			str = new String(byteArr, "GB2312");
		} catch (Exception e) {
			// TODO: handle exception
			e.printStackTrace();
		}
		return str;
	}

	/**
	 * @Title: randomChineseString
	 * @Description: ·µ»Ø²ÎÊılen¸öÖĞÎÄºº×Ö×Ö·û, ×Ö·û¼¯±ØĞëÔÚGB2312(Ïàµ±ÓÚÖĞÎÄ¼òÌå)·¶Î§ÄÚ, ÀıÈç"ÖĞÑ½±»"
	 * @param len
	 * @return
	 * @return: String
	 */
	public static String randomChineseString(int len) {
		String str = "";
		for (int i = 0; i < len; i++) {
			str += randomChineseString();
		}
		return str;
	}

	/**
	 * @Title: generaterChineseName
	 * @Description: TODO·µ»ØÖĞÎÄĞÕÃû
	 * @return
	 * @return: String
	 */
	public static String generaterChineseName() {
		String[] str = { "ÕÔ", "Ç®", "Ëï", "Àî", "ÖÜ", "Îâ", "Ö£", "Íõ", "·ë", "³Â", "èú", "ÎÀ", "½¯", "Éò", "º«", "Ñî", "Öì", "ÇØ", "ÓÈ",
				"Ğí", "ºÎ", "ÂÀ", "Ê©", "ÕÅ", "¿×", "²Ü", "ÑÏ", "»ª", "½ğ", "Îº", "ÌÕ", "½ª", "Æİ", "Ğ»", "×Ş", "Ó÷", "°Ø", "Ë®", "ñ¼", "ÕÂ",
				"ÔÆ", "ËÕ", "ÅË", "¸ğ", "ŞÉ", "·¶", "Åí", "ÀÉ", "Â³", "Î¤", "²ı", "Âí", "Ãç", "·ï", "»¨", "·½", "Óá", "ÈÎ", "Ô¬", "Áø", "Ûº",
				"±«", "Ê·", "ÌÆ", "·Ñ", "Á®", "á¯", "Ñ¦", "À×", "ºØ", "Äß", "ÌÀ", "ëø", "Òó", "ÂŞ", "±Ï", "ºÂ", "Úù", "°²", "³£", "ÀÖ", "ÓÚ",
				"Ê±", "¸µ", "Æ¤", "±å", "Æë", "¿µ", "Îé", "Óà", "Ôª", "²·", "¹Ë", "ÃÏ", "Æ½", "»Æ", "ºÍ", "ÄÂ", "Ïô", "Òü", "Ò¦", "ÉÛ", "Õ¿",
				"Íô", "Æî", "Ã«", "Óí", "µÒ", "Ã×", "±´", "Ã÷", "ê°", "¼Æ", "·ü", "³É", "´÷", "Ì¸", "ËÎ", "Ã©", "ÅÓ", "ĞÜ", "¼Í", "Êæ", "Çü",
				"Ïî", "×£", "¶­", "Áº", "¶Å", "Èî", "À¶", "Ãö", "Ï¯", "¼¾", "Âé", "Ç¿", "¼Ö", "Â·", "Â¦", "Î£", "½­", "Í¯", "ÑÕ", "¹ù", "Ã·",
				"Ê¢", "ÁÖ", "µó", "ïñ", "Ğì", "Çğ", "Âæ", "¸ß", "ÏÄ", "²Ì", "Ìï", "·®", "ºú", "Áè", "»ô", "Óİ", "Íò", "Ö§", "¿Â", "êÃ", "¹Ü",
				"Â¬", "Äª", "¾­", "·¿", "ôÃ", "çÑ", "¸É", "½â", "Ó¦", "×Ú", "¶¡", "Ğû", "êÚ", "µË", "Óô", "µ¥", "º¼", "ºé", "°ü", "Öî", "×ó",
				"Ê¯", "´Ş", "¼ª", "Å¥", "¹¨", "³Ì", "ïú", "ĞÏ", "»¬", "Åá", "Â½", "ÈÙ", "ÎÌ", "Ü÷", "Ñò", "ì¶", "»İ", "Õç", "üL", "¼Ò", "·â",
				"ÜÇ", "ôà", "´¢", "½ù", "¼³", "Úû", "ÃÓ", "ËÉ", "¾®", "¶Î", "¸»", "Î×", "ÎÚ", "½¹", "°Í", "¹­", "ÄÁ", "Úó", "É½", "¹È", "³µ",
				"ºî", "åµ", "Åî", "È«", "Û­", "°à", "Ñö", "Çï", "ÖÙ", "ÒÁ", "¹¬", "Äş", "³ğ", "èï", "±©", "¸Ê", "Ğ±", "À÷", "ÈÖ", "×æ", "Îä",
				"·û", "Áõ", "¾°", "Õ²", "Êø", "Áú", "Ò¶", "ĞÒ", "Ë¾", "ÉØ", "Û¬", "Àè", "¼»", "±¡", "Ó¡", "ËŞ", "°×", "»³", "ÆÑ", "Û¢", "´Ó",
				"¶õ", "Ë÷", "ÏÌ", "¼®", "Àµ", "×¿", "İş", "ÍÀ", "ÃÉ", "³Ø", "ÇÇ", "Òõ", "Óô", "ñã", "ÄÜ", "²Ô", "Ë«", "ÎÅ", "İ·", "µ³", "µÔ",
				"Ì·", "¹±", "ÀÍ", "åÌ", "¼§", "Éê", "·ö", "¶Â", "È½", "Ô×", "Ûª", "Óº", "àS", "è³", "É£", "¹ğ", "å§", "Å£", "ÊÙ", "Í¨", "±ß",
				"ìè", "Ñà", "¼½", "Û£", "ÆÖ", "ÉĞ", "Å©", "ÎÂ", "±ğ", "×¯", "êÌ", "²ñ", "öÄ", "ÑÖ", "³ä", "Ä½", "Á¬", "Èã", "Ï°", "»Â", "°¬",
				"Óã", "Èİ", "Ïò", "¹Å", "Ò×", "É÷", "¸ê", "ÁÎ", "â×", "ÖÕ", "ôß", "¾Ó", "ºâ", "²½", "¶¼", "¹¢", "Âú", "ºë", "¿ï", "¹ú", "ÎÄ",
				"¿Ü", "¹ã", "Â»", "ãÚ", "¶«", "Å·", "ì¯", "ÎÖ", "Àû", "Îµ", "Ô½", "Ùç", "Â¡", "Ê¦", "¹®", "ØÇ", "Äô", "êË", "¹´", "°½", "ÈÚ",
				"Àä", "ö¤", "ĞÁ", "ãÛ", "ÄÇ", "¼ò", "ÈÄ", "¿Õ", "Ôø", "Îã", "É³", "Ø¿", "Ñø", "¾Ï", "Ğë", "·á", "³²", "¹Ø", "Øá", "Ïà", "²é",
				"ºó", "¾£", "ºì", "ÓÎ", "óÃ", "È¨", "åÏ", "¸Ç", "Òæ", "»¸", "¹«", "½ú", "³ş", "ÑÖ", "·¨", "Èê", "Û³", "Í¿", "ÇÕ", "ÔÀ", "Ë§",
				"çÃ", "¿º", "¿ö", "ºó", "ÓĞ", "ÇÙ", "ÉÌ", "Ä²", "ÙÜ", "Ù¦", "²®", "ÉÍ", "Ä«", "¹ş", "ÚÛ", "óÎ", "Äê", "°®", "Ñô", "Ù¡",
				"ÍòÙ¹", "Ë¾Âí", "ÉÏ¹Ù", "Å·Ñô", "ÏÄºî", "Öî¸ğ", "ÎÅÈË", "¶«·½", "ºÕÁ¬", "»Ê¸¦", "Î¾³Ù", "¹«Ñò", "å£Ì¨", "¹«Ò±", "×ÚÕş", "å§Ñô", "´¾ÓÚ",
				"µ¥ÓÚ", "Ì«Êå", "ÉêÍÀ", "¹«Ëï", "ÖÙËï", "ĞùÔ¯", "Áîºü", "ïñÀë", "ÓîÎÄ", "³¤Ëï", "Ä½Èİ", "ÏÊÓÚ", "ãÌÇğ", "Ë¾Í½", "Ë¾¿Õ", "Ø¢¹Ù", "Ë¾¿Ü",
				"Øë", "¶½", "×Ó³µ", "ò§Ëï", "¶ËÄ¾", "Î×Âí", "¹«Î÷", "Æáµñ", "ÀÖÕı", "ÈÀæá", "¹«Á¼", "ÍØ°Î", "¼Ğ¹È", "Ô×¸¸", "¹ÈÁº", "¶Î¸É", "°ÙÀï",
				"¶«¹ù", "ÄÏÃÅ", "ºôÑÓ", "¹é", "º£", "ÑòÉà", "Î¢Éú", "ÁºÇğ", "×óÇğ", "¶«ÃÅ", "Î÷ÃÅ", "ÄÏ¹¬" };
		String firstName = str[RandomUtil.random(0, str.length - 1)];
		String lastName = randomChineseString(RandomUtil.random(1, 2));
		return firstName + lastName;
	}
}
